src/Catalogs/СобытияПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СобытияПланировщика</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Task.ЗадачаИсполнителя</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВесьДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаИсполнителя</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариПланировщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоСобытияЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОригинальноеНачалоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОригинальноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияПланировщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторВидОкончания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторДниПовторения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторИнтервал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторПериодичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повторять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСобытийПланировщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтороннееСобытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветоваяГаммаПланировщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/УчастникиСобытийПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>УчастникиСобытийПланировщика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникиСобытия</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОригинальноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияПланировщика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариПланировщика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организатор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Синхронизировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Уведомлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияПланировщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчастника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчастниковСобытийПланировщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НапоминанияСобытийПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НапоминанияСобытийПланировщика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Интервал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИнтервала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИнтервалСекунды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияПланировщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГраницыСобытийПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГраницыСобытийПланировщика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоНапоминаний</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеНапоминаний</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияПланировщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПовторений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеПовторений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыСобытийПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыСобытийПланировщика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыУчастниковСобытийПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыУчастниковСобытийПланировщика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастникСсылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастникСтрока</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СобытияПланировщика/Ext/ObjectModule.bsl
Перем Участники Экспорт; // все участники события независимо от пользователя
Перем Напоминания Экспорт; // все напоминания по событию независимо от пользователя

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПоОбъектуОснованию(Основание) Экспорт
	
	ТипЗначенияОснования = ТипЗнч(Основание);
	
	Если ТипЗначенияОснования = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Ссылка, Наименование, ДатаНачала, СрокИсполнения, Описание");
		
		ЭтотОбъект.Наименование = Реквизиты.Наименование;
		ЭтотОбъект.Содержание	= Реквизиты.Описание;
		
		ЭтотОбъект.ОкончаниеСобытия		= Реквизиты.СрокИсполнения;
		ЭтотОбъект.НачалоСобытия		= ?(Реквизиты.ДатаНачала <> Дата(1, 1, 1), Реквизиты.ДатаНачала, ЭтотОбъект.ОкончаниеСобытия - 3600);
		ЭтотОбъект.ЗадачаИсполнителя	= Реквизиты.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоСтруктуреСобытия(СтруктураСобытия) Экспорт
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураСобытия.НастройкаПовтора);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураСобытия, , "Напоминания, Участники");
	
	// Проверим заполнение кода
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Код) Тогда
		ЭтотОбъект.УстановитьНовыйКод();
	КонецЕсли;
	
	// Напоминания
	Для Каждого СтруктураНапоминания Из СтруктураСобытия.Напоминания Цикл
		СтрокаНапоминания = ЭтотОбъект.Напоминания.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНапоминания, СтруктураНапоминания);
	КонецЦикла;
	
	// Участники
	Для Каждого СтруктураУчастники Из СтруктураСобытия.Участники Цикл
		СтрокаУчастники = ЭтотОбъект.Участники.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаУчастники, СтруктураУчастники);
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьЗаполнениеПередЗаписью() Экспорт
	// ПовторПредставление
	Если ЭтотОбъект.Повторять И ПустаяСтрока(ЭтотОбъект.ПовторПредставление) Тогда
		СтруктураПовторения = ПланировщикДанныеКлиентСервер.ПолучитьСтруктуруПовторения();
		ЗаполнитьЗначенияСвойств(СтруктураПовторения, ЭтотОбъект);
		ЭтотОбъект.ПовторПредставление = ПланировщикДанныеКлиентСервер.ПолучитьПредставлениеПовторения(СтруктураПовторения);
	КонецЕсли;
	
	// Статус
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Статус) Тогда
		ЭтотОбъект.Статус = Перечисления.СтатусыСобытийПланировщика.Подтверждено;
	КонецЕсли;
	
	// Статус, ПометкаУдаления
	СтатусИзменился		= СтатусИзменился();
	ПометкаИзменилась	= ПометкаУдаленияИзменилась();
	Если СтатусИзменился Тогда
		ЭтотОбъект.ПометкаУдаления = (ЭтотОбъект.Статус = Перечисления.СтатусыСобытийПланировщика.Отменено);
	ИначеЕсли ПометкаИзменилась Тогда
		ЭтотОбъект.Статус = ?(ЭтотОбъект.ПометкаУдаления, Перечисления.СтатусыСобытийПланировщика.Отменено, Перечисления.СтатусыСобытийПланировщика.Подтверждено);
	КонецЕсли;
	
	// Период события
	Если ПовторНачало < НачалоСобытия Тогда
		ПовторНачало = НачалоСобытия;
	КонецЕсли;
	
	ОкруглитьВыбранноеВремя("НачалоСобытия");
	ОкруглитьВыбранноеВремя("ОкончаниеСобытия");
	
	// Настройка повторения
	ПроверитьНастройкуПовторения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЗаписи

Процедура ЗаписатьУчастниковСобытийПланировщика(Отказ)
	МассивСтрок = Участники.НайтиСтроки(Новый Структура("Участник", ЭтотОбъект.Владелец));
	Если МассивСтрок.Количество() = 0 Тогда
		СтрокаОрганизатор = Участники.Добавить();
		СтрокаОрганизатор.Участник		= ЭтотОбъект.Владелец;
		СтрокаОрганизатор.Идентификатор	= Новый УникальныйИдентификатор;
		СтрокаОрганизатор.Представление	= Строка(ЭтотОбъект.Владелец);
	Иначе 
		СтрокаОрганизатор = МассивСтрок[0];
	КонецЕсли;
	СтрокаОрганизатор.ВидУчастника	= Перечисления.ВидыУчастниковСобытийПланировщика.Организатор;
	СтрокаОрганизатор.Организатор	= Истина;
	
	РегистрыСведений.УчастникиСобытийПланировщика.ВыполнитьЗапись(Отказ, ЭтотОбъект.Ссылка, Участники);
КонецПроцедуры

Процедура ЗаписатьНапоминанияСобытийПланировщика(Отказ)
	
	РегистрыСведений.НапоминанияСобытийПланировщика.ВыполнитьЗапись(Отказ, ЭтотОбъект.Ссылка, Неопределено, Напоминания);
	
КонецПроцедуры

Процедура ЗаписатьГраницыСобытияПланировщика(Отказ)
	
	СдвигНапоминанийНачало	= 0;
	СдвигНапоминанийКонец	= 3 * ПланировщикКлиентСервер.МесяцВСекундах(31);
	ЕстьНапоминания			= (ЭтотОбъект.Напоминания.Количество() > 0);
	Для Каждого СтрокаНапоминания Из ЭтотОбъект.Напоминания Цикл
		СдвигНапоминанийНачало	= Макс(СдвигНапоминанийНачало, СтрокаНапоминания.ИнтервалСекунды);
		СдвигНапоминанийКонец	= Мин(СдвигНапоминанийКонец, СтрокаНапоминания.ИнтервалСекунды);
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.ГраницыСобытийПланировщика.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Событие.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Если НЕ ЭтотОбъект.Статус = Перечисления.СтатусыСобытийПланировщика.Отменено Тогда
		Если НЕ ЭтотОбъект.Повторять Тогда
			НачалоПовторений	= НачалоДня(ЭтотОбъект.НачалоСобытия);
			ОкончаниеПовторений	= НачалоДня(ЭтотОбъект.ОкончаниеСобытия);
		Иначе 
			НачалоПовторений	= ЭтотОбъект.ПовторНачало;
			ОкончаниеПовторений = ПланировщикДанные.РассчитатьКонецПериодаПовторений(ЭтотОбъект.Ссылка);
		КонецЕсли;
		СдвигСНачалаДня = ЭтотОбъект.НачалоСобытия - НачалоДня(ЭтотОбъект.НачалоСобытия);
		
		ЗаписьРегистра = НаборЗаписей.Добавить();
		ЗаписьРегистра.Событие				= ЭтотОбъект.Ссылка;
		ЗаписьРегистра.НачалоПовторений		= НачалоПовторений;
		ЗаписьРегистра.ОкончаниеПовторений	= ОкончаниеПовторений;
		ЗаписьРегистра.НачалоНапоминаний	= ?(НЕ ЕстьНапоминания, Дата(1, 1, 1), НачалоПовторений + СдвигСНачалаДня - СдвигНапоминанийНачало);
		ЗаписьРегистра.ОкончаниеНапоминаний	= ?(НЕ ЕстьНапоминания, Дата(1, 1, 1), ОкончаниеПовторений + СдвигСНачалаДня - СдвигНапоминанийКонец);
	КонецЕсли;
	
	НаборЗаписей.Записать();
			
КонецПроцедуры

Процедура ЗаписатьСтатусПодчиненныхСобытий(Отказ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Статус", ЭтотОбъект.Статус);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытияПланировщика.Ссылка
	|ИЗ
	|	Справочник.СобытияПланировщика КАК СобытияПланировщика
	|ГДЕ
	|	СобытияПланировщика.ОригинальноеСобытие = &Ссылка
	|	И СобытияПланировщика.Статус <> &Статус";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Попытка
		// Блокируем данные для записи
		Блокировка = Новый БлокировкаДанных;
		
		Элемент = Блокировка.Добавить("Справочник.СобытияПланировщика");
		Элемент.Режим = РежимБлокировкиДанных.Исключительный;
		Элемент.ИсточникДанных = РезультатЗапроса;
		Элемент.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
		
		Блокировка.Заблокировать();
		
		// Считываем записи и заполняем их вновь
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЭлементОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЭлементОбъект.Статус = ЭтотОбъект.Статус;
			ЭлементОбъект.Записать();
		КонецЦикла;  
	Исключение
		Отказ = Истина;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеПередЗаписью();
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("СтатусИзменился", СтатусИзменился());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьУчастниковСобытийПланировщика(Отказ);
	ЗаписатьНапоминанияСобытийПланировщика(Отказ);
	ЗаписатьГраницыСобытияПланировщика(Отказ);
	
	ИзменитьСтатусПодчиненных = Ложь;
	Результат = ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусИзменился", ИзменитьСтатусПодчиненных);
	Если Результат И ИзменитьСтатусПодчиненных Тогда
		ЗаписатьСтатусПодчиненныхСобытий(Отказ);
	КонецЕсли;
	
	Справочники.СобытияПланировщика.ВыполнитьОбновлениеДанныхОповещения(ЭтотОбъект.Ссылка, Истина);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено
		И ТипДанныхЗаполнения <> Тип("Структура") 
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		
		ЗаполнитьПоОбъектуОснованию(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		ЗаполнитьПоСтруктуреСобытия(ДанныеЗаполнения);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Статус) Тогда
		ЭтотОбъект.Статус = Перечисления.СтатусыСобытийПланировщика.Подтверждено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Владелец) Тогда
		ЭтотОбъект.Владелец = Пользователи.ТекущийПользователь();
	КонецЕсли;
 	
	Если ЭтотОбъект.НачалоСобытия = Дата(1, 1, 1) Тогда
		ЭтотОбъект.НачалоСобытия = ТекущаяДатаСеанса();
	КонецЕсли;	
    ОкруглитьВыбранноеВремя("НачалоСобытия");
	
	Если ЭтотОбъект.ОкончаниеСобытия = Дата(1, 1, 1) Тогда
		ЭтотОбъект.ОкончаниеСобытия = ЭтотОбъект.НачалоСобытия + 3600;
	КонецЕсли;
	ОкруглитьВыбранноеВремя("ОкончаниеСобытия");
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Календарь) Тогда
		ЭтотОбъект.Календарь = ПланировщикДанные.ПолучитьОсновнойКалендарьПользователя(ЭтотОбъект.Владелец);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОкруглитьВыбранноеВремя(ИмяРеквизита)
	ЗначениеВремени = НачалоМинуты(ЭтотОбъект[ИмяРеквизита]);
	
	Если ЭтотОбъект.ВесьДень Тогда
		ЭтотОбъект[ИмяРеквизита] = ?(ИмяРеквизита = "НачалоСобытия", НачалоДня(ЗначениеВремени), КонецДня(ЗначениеВремени));
	Иначе 
		ЭтотОбъект[ИмяРеквизита] = ПланировщикКлиентСервер.ОкруглитьВыбранноеВремя(ЗначениеВремени);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьНастройкуПовторения()
	Если ПовторПериодичность = 6 И НЕ ЗначениеЗаполнено(ПовторДниПовторения) Тогда
		ПовторДниПовторения = "1";
	КонецЕсли;
	
	//ПовторДниПовторения = СтрЗаменить(ПовторДниПовторения, "  ", " ");
	ПовторДниПовторения = СтрЗаменить(ПовторДниПовторения, " ", "");
	
	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПовторДниПовторения);
	
	Количество = МассивПодстрок.Количество();
	Есть_1 = НЕ (МассивПодстрок.Найти("1") = Неопределено);
	Есть_2 = НЕ (МассивПодстрок.Найти("2") = Неопределено);
	Есть_3 = НЕ (МассивПодстрок.Найти("3") = Неопределено);
	Есть_4 = НЕ (МассивПодстрок.Найти("4") = Неопределено);
	Есть_5 = НЕ (МассивПодстрок.Найти("5") = Неопределено);
	Есть_6 = НЕ (МассивПодстрок.Найти("6") = Неопределено);
	Есть_7 = НЕ (МассивПодстрок.Найти("7") = Неопределено);
	
	Если Количество = 5 И Есть_1 И Есть_2 И Есть_3 И Есть_4 И Есть_5 Тогда
		ПовторПериодичность = 2;
		ПовторДниПовторения = "";
	ИначеЕсли Количество = 3 И Есть_1 И Есть_3 И Есть_5 Тогда
		ПовторПериодичность = 3;
		ПовторДниПовторения	= "";
	ИначеЕсли Количество = 2 И Есть_2 И Есть_4 Тогда
		ПовторПериодичность = 4;
		ПовторДниПовторения = "";
	КонецЕсли;
КонецПроцедуры

Функция СтатусИзменился()
	СтатусСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка, "Статус");
	Возврат СтатусСсылка <> ЭтотОбъект.Статус;
КонецФункции

Функция ПометкаУдаленияИзменилась()
	ПометкаУдаленияСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка, "ПометкаУдаления");
	Возврат ПометкаУдаленияСсылка <> ЭтотОбъект.ПометкаУдаления;
КонецФункции

#КонецОбласти

#Область ИнициализацияМодуля

Процедура ИнициализацияМодуля()
	
	// Участники
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СобытиеПланировщика", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчастникиСобытийПланировщика.*
	|ИЗ
	|	РегистрСведений.УчастникиСобытийПланировщика КАК УчастникиСобытийПланировщика
	|ГДЕ
	|	УчастникиСобытийПланировщика.Событие = &СобытиеПланировщика
	|	И УчастникиСобытийПланировщика.Организатор = Ложь";
	Участники = Запрос.Выполнить().Выгрузить();

	Участники.Колонки.Удалить("Событие");

	Участники.Индексы.Добавить("Идентификатор");
	Участники.Индексы.Добавить("ВидУчастника, Участник");
	Участники.Индексы.Добавить("Участник");
	
	// Напоминания
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СобытиеПланировщика"	, ЭтотОбъект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НапоминанияСобытийПланировщика.*
	|ИЗ
	|	РегистрСведений.НапоминанияСобытийПланировщика КАК НапоминанияСобытийПланировщика
	|ГДЕ
	|	НапоминанияСобытийПланировщика.Событие = &СобытиеПланировщика";
	Напоминания = Запрос.Выполнить().Выгрузить();

	Напоминания.Колонки.Удалить("Событие");

	Напоминания.Индексы.Добавить("Пользователь, Идентификатор");
	
КонецПроцедуры

ИнициализацияМодуля();

#КонецОбласти
